zyitom/test_slave_bridge/firmware/ch32_board/bsp/usb/ch32h417_usbss_it.c
/********************************** (C) COPYRIGHT *******************************
* File Name          : ch32h417_it.c
* Author             : WCH
* Version            : V1.0.3
* Date               : 2026/04/10
* Description        : USBSS functions Interrupt Service Routines.
*********************************************************************************
* Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#include "ch32h417_it.h"
#include "ch32h417_usb.h"
#include "usb_desc.h"
#include "ch32h417_usbss_device.h"
#include "string.h"
 
/* Global */
const uint8_t    *pUSBSS_Descr;

/* Setup Request */
volatile uint8_t  USBSS_SetupReqType;
volatile uint8_t  USBSS_SetupReqCode;
volatile uint16_t USBSS_SetupReqValue;
volatile uint16_t USBSS_SetupReqIndex;
volatile uint16_t USBSS_SetupReqLen;

/* USB Device Status */
volatile uint8_t  USBSS_DevConfig;
volatile uint8_t  USBSS_DevAddr;
volatile uint16_t USBSS_DevMaxPackLen;
volatile uint8_t  USBSS_DevSpeed;
volatile uint8_t  USBSS_DevSleepStatus;
volatile uint8_t  USBSS_DevEnumStatus;

/* Endpoint Buffer */
__attribute__ ((aligned(4))) uint8_t USBSS_EP0_Buf[ DEF_USBSSD_UEP0_SIZE ];
__attribute__ ((aligned(4))) uint8_t USBSS_EP1_Rx_Buf[ DEF_USB_EP1_SS_SIZE * DEF_ENDP1_OUT_BURST_LEVEL * DEF_ENDP1_OUT_BUFF_SIZE ];
__attribute__ ((aligned(4))) uint8_t USBSS_EP2_Rx_Buf[ DEF_USB_EP2_SS_SIZE * DEF_ENDP2_OUT_BURST_LEVEL * DEF_ENDP2_OUT_BUFF_SIZE ];
__attribute__ ((aligned(4))) uint8_t USBSS_EP3_Rx_Buf[ DEF_USB_EP3_SS_SIZE * DEF_ENDP3_OUT_BURST_LEVEL * DEF_ENDP3_OUT_BUFF_SIZE ];

/* LIBRMCS LOCAL PATCH: EP1 is repurposed as the librmcs bulk pipe. The CH372
 * demo's EP1<->EP2 hardware DMA loopback is replaced by calls into the C++ USB
 * layer (see app/src/usb/vendor.cpp). Documented in bsp/PROVENANCE.md. */
extern void usb_ss_ep1_in_complete(void);
extern void usb_ss_ep1_out_complete(void);

void USBSS_IRQHandler (void) __attribute__((interrupt("WCH-Interrupt-fast")));
void USBSS_LINK_IRQHandler (void) __attribute__((interrupt("WCH-Interrupt-fast")));

/*********************************************************************
 * @fn      USBSS_LINK_IRQHandler
 *
 * @brief   This function handles USBSS LINK exception.
 *
 * @return  none
 */
void USBSS_LINK_IRQHandler( void )          
{
    USBSS_LINK_Handle( USBSSH );
}

/*********************************************************************
 * @fn      USBSS_Endp_Clear_Frature
 *
 * @brief   Clear the endpoint feature.
 *
 * @return  Whether it was cleared successfully.
 */
uint8_t USBSS_Endp_Clear_Frature( uint8_t dir_endp )         
{
    if(( dir_endp & DEF_UEP_MASK ) > DEF_UEP15 )
    {
        return 0xff;
    }
    if(( dir_endp & DEF_UEP_IN ))
    {
        USBSS_EP_TX_TypeDef* endp = (USBSS_EP_TX_TypeDef*)( &USBSSD->EP1_TX + ((( dir_endp - 1 ) & 0x7f ) * 2));
        endp->UEP_TX_CR = USBSS_EP_TX_CLR | USBSS_EP_TX_CHAIN_CLR;
    }
    else
    {
        USBSS_EP_RX_TypeDef* endp = (USBSS_EP_RX_TypeDef*)( &USBSSD->EP1_RX + ( dir_endp - 1 ) * 2 );
        endp->UEP_RX_CR |= USBSS_EP_RX_CLR | USBSS_EP_RX_CHAIN_CLR;
        endp->UEP_RX_CHAIN_MAX_NUMP = DEF_ENDP1_OUT_BURST_LEVEL;
    }
    return 0x00;
}

/*********************************************************************
 * @fn      USBSS_Endp_Set_Frature
 *
 * @brief   Set the endpoint feature.
 *
 * @return  Whether it was cleared successfully.
 */
uint8_t USBSS_Endp_Set_Frature( uint8_t dir_endp )         
{
    if(( dir_endp & DEF_UEP_MASK ) > DEF_UEP15 )
    {
        return 0xff;
    }
    if(( dir_endp & DEF_UEP_IN ))
    {
        USBSS_EP_TX_TypeDef* endp = (USBSS_EP_TX_TypeDef*)( &USBSSD->EP1_TX + ((( dir_endp - 1 ) & 0x7f ) * 2));
        endp->UEP_TX_CR |= USBSS_EP_TX_HALT;
    }
    else
    {
        USBSS_EP_RX_TypeDef* endp = (USBSS_EP_RX_TypeDef*)( &USBSSD->EP1_RX + ( dir_endp - 1 ) * 2 );
        endp->UEP_RX_CR |= USBSS_EP_RX_HALT;
    }
    return 0x00;
}

/*********************************************************************
 * @fn      USBSS_Get_Endp_Status
 *
 * @brief   Get the endpoint status.
 *
 * @return  Whether it was cleared successfully.
 */
uint8_t USBSS_Get_Endp_Status( uint8_t dir_endp )         
{
    if(( dir_endp & DEF_UEP_MASK ) > DEF_UEP15 )
    {
        return 0xff;
    }
    if(( dir_endp & DEF_UEP_MASK ) == DEF_UEP0 )
    {
        return 0x00;
    }
    if(( dir_endp & DEF_UEP_IN ))
    {
        USBSS_EP_TX_TypeDef* endp = (USBSS_EP_TX_TypeDef*)( &USBSSD->EP1_TX + ((( dir_endp - 1 ) & 0x7f ) * 2 ));
        if( endp->UEP_TX_CR & USBSS_EP_TX_HALT )
        {
            USBSS_EP0_Buf[ 0 ] = 0x01;
        }
    }
    else
    {
        USBSS_EP_RX_TypeDef* endp = (USBSS_EP_RX_TypeDef*)( &USBSSD->EP1_RX + ( dir_endp - 1 ) * 2 );
        if( endp->UEP_RX_CR & USBSS_EP_RX_HALT )
        {
            USBSS_EP0_Buf[ 0 ] = 0x01;
        }
    }
    return 0x00;
}
/*********************************************************************
 * @fn      USBSS_IRQHandler
 *
 * @brief   This function handles USBSS exception.
 *
 * @return  none
 */
void USBSS_IRQHandler( void )              
{
    uint8_t endp_num;
    uint8_t  errflag;
    uint16_t len;
    uint32_t ep_dir;
    uint32_t status = 0;
    status = USBSSD->USB_STATUS;

    if(( status & USBSS_UDIF_SETUP ) && !( status & USBSS_UDIF_STATUS ))    // SETUP-DPH & ACK-TP
    {
        USBSS_Dev_Info.set_devaddr = 0;
        USBSS_Dev_Info.set_isoch_delay = 0;

        /* Store All Setup Values */
        USBSS_SetupReqType  = pUSBSS_SetupReqPak->bRequestType;
        USBSS_SetupReqCode  = pUSBSS_SetupReqPak->bRequest;
        USBSS_SetupReqLen   = pUSBSS_SetupReqPak->wLength;
        USBSS_SetupReqValue = pUSBSS_SetupReqPak->wValue;
        USBSS_SetupReqIndex = pUSBSS_SetupReqPak->wIndex;

        len = 0;
        errflag = 0;
        if(( USBSS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
        {
            /* usb non-standard request processing */
            errflag = 0xFF;
        }
        else 
        {
            switch( USBSS_SetupReqCode )
            {
                /* get device/configuration/string/report/... descriptors */
                case USB_GET_DESCRIPTOR:
                    switch((uint8_t)( USBSS_SetupReqValue >> 8 ))
                    {
                        /* get usb device descriptor */
                        case USB_DESCR_TYP_DEVICE:
                            pUSBSS_Descr = SS_DeviceDescriptor;
                            len = DEF_USBSSD_DEVICE_DESC_LEN;
                            break;

                        /* get usb configuration descriptor */
                        case USB_DESCR_TYP_CONFIG:
                            pUSBSS_Descr = SS_ConfigDescriptor;
                            len = DEF_USBSSD_CONFIG_DESC_LEN;
                            break;

